; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 944760 2 2 2 7 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star1 - direction
	Star5 - direction
	Star3 - direction
	GroundStation6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(have_image Planet7 thermograph1)
	(have_image Phenomenon8 thermograph0)
	(have_image Star9 thermograph1)
	(have_image Planet10 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (turn_to satellite1 groundstation6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 4
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
4. (turn_to satellite0 planet7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet7)
   goals met: 0 of 4
5. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 4
6. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   goals met: 0 of 4
7. (turn_to satellite1 star9 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star9)
   goals met: 0 of 4
8. (turn_to satellite0 star1 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star1)
   goals met: 0 of 4
9. (take_image satellite1 star9 instrument2 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 1 of 4
10. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 4
11. (turn_to satellite1 phenomenon8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 4
12. (turn_to satellite0 planet7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet7)
   goals met: 1 of 4
13. (take_image satellite0 planet7 instrument1 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 2 of 4
14. (take_image satellite1 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 3 of 4
15. (turn_to satellite1 planet10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet10)
   goals met: 3 of 4
16. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   goals met: 3 of 4
17. (take_image satellite0 planet10 instrument1 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 4 of 4
